---
kind: method
id: M:Autodesk.Revit.Exceptions.FunctionId.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/e8cac566-d229-8fe4-b41d-67fbb290b55f.htm
---
# Autodesk.Revit.Exceptions.FunctionId.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public virtual void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.